abc102_a.hs
######################################
head は Haskell の Prelude モジュールに定義されている関数で、リストの先頭要素を取得するための関数です。
######################################
######################################
######################################
######################################
######################################
######################################
######################################
main = getLine >>= print . compute . read

compute n
  | even n = n
  | True   = 2 * n

######################################
main = do
    n <- readLn
    putStrLn $ show $ solve n

solve n
    | odd n     = 2*n
    | otherwise = n
######################################
main = do
  n <- map read . words <$> getLine :: IO [Int]
  if even (head n)
    then putStrLn (show (head n))
    else putStrLn (show (head n * 2))
######################################
